app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "author", "content") VALUES (?, ?, ?)  [["title", "Miłość w czasach zarazyy"], ["author", "Llosa"], ["content", "Fajna książka"]]
---
  def create #wrzuca to do bazy danych
    @article = Article.new(params[:article])

    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "articles" SET "content" = ? WHERE "articles"."id" = ?  [["content", "The best content in the world!!!"], ["id", 3]]
---
  def update
    @article = Article.find(params[:id])
    @article.title = params[:article][:title]
    @article.author = params[:article][:author]
    @article.content = params[:article][:content]
    @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
  def destroy
    Article.delete(params[:id])